# 9.Вводятся три разных числа.
# Найти, какое из них является средним (больше одного, но меньше другого).

num_1 = int(input('Введите первое число: '))
num_2 = int(input('Введите второе число: '))
num_3 = int(input('Введите третье число: '))

if num_2 < num_1 < num_3 or num_2 > num_1 > num_3:
    print('Первое число - среднее')
elif num_1 < num_2 < num_3 or num_1 > num_2 > num_3:
    print('Второе число - среднее')
elif num_1 < num_3 < num_2 or num_1 > num_3 > num_2:
    print('Третье число - среднее')
else:
    print('Невозможно определить среднее, все или некоторые числа - равны')